/*Задача 7:
 *  Суми през 3
Дадени са n цели числа a1, a2, …, an. Да се пресметнат сумите:
•	sum1 = a1 + a4 + a7 + … (сумират се числата започвайки от първото със стъпка 3)
•	sum2 = a2 + a5 + a8 + … (сумират се числата започвайки от второто със стъпка 3)
•	sum3 = a3 + a6 + a9 + … (сумират се числата започвайки от третото със стъпка 3)
Вход
Входните данни се четат от конзолата. На първия ред стои цяло число n (0 ≤ n ≤ 1000). На следващите n реда стоят n цели числа в интервала [-1000…1000]: a1, a2, …, an.
Изход
На конзолата трябва да се отпечатат 3 реда, съдържащи търсените 3 суми, във формат като в примерите.*/

namespace _07.Sums_Step_3
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Text;
    using System.Threading.Tasks;
    class Program
    {
        static void Main()
        {
        }
    }
}
