/*Задача 6:
 * Суми от 3 числа
Дадени са 3 цели числа. Да се напише програма, която проверява дали сумата на две от числата е равна на третото. Например, ако числата са 3, 5 и 2, сумата на две от числата е равна на третото: 2 + 3 = 5.
Вход
От конзолата се четат три цели числа, по едно на ред. Числата са в диапазона [1…1000].
Изход
•	Да се отпечата на конзолата един ред, съдържащ решението на задачата във формат “A + B = C”, където A, B и C са измежду входните три числа и  A ≤ B.
•	Ако задачата няма решение, да се отпечата „No“ на конзолата.*/

namespace _06.Sums_3_Numbers
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Text;
    using System.Threading.Tasks;
    class Program
    {
        static void Main()
        {
        }
    }
}
