/*Задача 8:
 * Поредица от нарастващи елементи
Дадена е редица от n числа: a1, a2, …, an. Да се пресметне дължината на най-дългата нарастваща поредица от последователни елементи в редицата от числа.
Вход
Входните данни се четат от конзолата. На първия ред стои цяло число n (0 ≤ n ≤ 1000). На следващите n реда стоят n цели числа в интервала [-1000…1000]: a1, a2, …, an.
Изход
На конзолата трябва да се отпечата едно число – дължината на най-дългата нарастваща редица.*/

namespace _08.Increasing_Elements
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Text;
    using System.Threading.Tasks;
    class Program
    {
        static void Main()
        {
        }
    }
}
