/* Задача 12: Генериране на правоъгълници
 * По дадено число n и минимална площ m да се генерират всички правоъгълници с цели координати в интервала [-n…n] с площ поне m. Генерираните правоъгълници да се отпечатат в следния формат:
(left, top) (right, bottom) -> area
Правоъгълниците се задават чрез горния си ляв и долния си десен ъгъл. В сила са следните неравенства:
•	-n ≤ left < right ≤ n
•	-n ≤ top < bottom ≤ n
Вход
От конзолата се въвеждат две числа, по едно на ред:
•	Цяло число n в интервала [1…100] – задава минималната и максималната координата на връх.
•	Цяло число m в интервала [0…50000] – задава минималната площ на генерираните правоъгълници.
Изход
•	На конзолата трябва да се отпечатат описаните правоъгълници във формат като в примерите по-долу.
•	Ако за числата n и m няма нито един правоъгълник, да се изведе “No”.
•	Редът на извеждане на правоъгълниците е без значение.
*/

namespace _12.Generate_Rectangles
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Text;
    using System.Threading.Tasks;
    class Program
    {
        static void Main()
        {
        }
    }
}
